<?php

namespace Database\Seeders;

use App\Models\ProductType;
use Illuminate\Database\Seeder;

class ProductTypesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        $statuses = [
            "頭髪用",
            "リップ",
            "マスク",
            "化粧水",
            "ネイル",
            "歯みがき類",
            "アイメイク",
            "日焼け止め",
            "ファンデーション",
            "クレンジング",
            "香水",
            "雑貨",
            "マッサージ料",
            "石けん類",
            "クリーム",
            "乳液",
            "チーク",
            "化粧下地",
            "美容液",
            "その他",
            "浴用化粧料",
            "オイル",
            "CBD",
            "保湿",
            "ハイライト",
            "洗顔料",
            "コンシーラー",
            "ボディ",
            "顔.体用",
            "眉(まゆ)",
            "フェイスパウダー",
            "目元",
            "洗浄料",
            "シェーディング",
            "髭用",
            "まつ毛用",
            "ローション",
            "パウダー",
            "ヘアオイル",
            "シャンプー",
            "フェイスクレンザー",
            "ボディローション",
            "ボディバーム",
            "ハンドソープ",
            "ボディソープ",
            "ベビーパウダー",
            "化粧水パッド",
            "アイシャドウ",
            "パック",
            "リップスティック",
            "リップライナー",
            "保湿スプレー",
            "トリートメント",
            "ヘアパック",
            "アイジェルクリーム",
            "マッサージオイル",
            "リップグロス",
            "ボディクレンザー",
            "マスカラ",
            "リップカラー",
            "アイライナー",
            "下地",
            "ふきとり",
            "ジェル",
            "フット",
            "リップバーム",
            "フェイス",
            "アイ",
            "アイカラー",
            "シャドウ",
            "ハンド",
            "シェービング",
            "スティック",
            "液体歯磨き",
            "スプレー",
            "ひげ",
            "バーム",
            "ベース",
            "ブロンザー",
            "ブラッシャー",
            "プレシェーブ",
            "ポマード",
            "アフターシェービング",
            "ヘアミスト",
            "パッド",
            "パッチ",
            "フォーム",
            "トーンアップ",
            "美容",
            "ふきとり用",
            "固型",
            "ヘアワックス",
            "アイブロー",
            "スクラブ",
            "カラー",
            "ヘアジェル",
            "ヘア",
            "ワックス",
            "ソープ",
            "クレンザー",
            "ベースコート",
            "ヘアコンディショナー",
            "洗い流さない",
            "化粧石けん",
            "ミスト",
            "頭皮用",
            "おしろい",
            "水性",
            "油性",
            "メークアップ",
            "鼻用",
            "爪化粧料",
            "食品",
            "練り",
            "眉毛",
            "フェイシャル"
        ];

        foreach($statuses as $status){
            $type = new ProductType();
            $type->name = $status;
            $type->save();
        }
    }
}
